import os
import shutil

# Задание №8
# Нарисовать в консоли ёлку спросив
# у пользователя количество рядов.

# row = int(input('Введите количество рядов: '))
# k = row
# j = 1
# for _ in range(row):
#     print(' ' * (k - 1), '*' * j, sep='')
#     k -= 1
#     j += 2

# Через форматирование строки

# height = int(input('Введите высоту ёлки: '))
#
# for row in range(height):
#     print(f'{"*" * (2 * row + 1):^{height * 2 +1}}') #после двоеточия можно поставить символ заполнения
#


